{
  "遠征から戻って来ました。": "Sebuah armada kembali dari ekspedisi.",
  "【年賀】2024年令和六年、謹賀新年！": "2024, Tahun ke-6 Reiwa, Selamat Tahun Baru!",
  "プレゼント箱 を獲得しました！": "Kotak Hadiah diperoleh!",
  "艦娘からのチョコ を獲得しました！": "Cokelat dari Shipgirls diperoleh!",
  "いつも本当にありがとう！こちらもどうぞ！": "Terima kasih atas dukungan Anda yang berkelanjutan! Ini adalah untuk Anda!",
  "提督、いつも感謝ですっ！こちらもどうぞ！": "Laksamana, kami sangat berterima kasih! Ini adalah untuk Anda!",
  "いつも感謝です！こちらもどうぞお使いください！": "Terima kasih seperti biasa! Tolong manfaatkan ini sebaik-baiknya!",
  "提督、本当に感謝です！こちらもどうぞっ！": "Laksamana, kami sangat berterima kasih! Ini adalah untuk Anda!",
  "装備運用枠【＋10装備分】 を獲得しました！": "Penyimpanan Peralatan [10 slot] diperoleh!",
  "「艦これ」十周年、提督、ありがとうございます！": "Hari Jadi KanColle yang ke 10! Laksamana, terima kasih!",
  "提督、あけましておめでとうございます": "Laksamana, selamat tahun baru!",
  "「艦これ」は今春10周年！提督、本当に感謝です！": "KanColle akan berusia 10 tahun pada musim semi ini! Laksamana, kami sangat berterima kasih!",
  "給糧艦「間宮」 x 10 を獲得しました！": "「Mamiya」 Persediaan Makanan x10 diperoleh!",
  "提督と共に、まさかまさかの10周年……感慨深いです。": "10 tahun bersama Laksamana... Kami tidak akan pernah menyangka, dan kami sangat tersentuh!",
  "ありがとうございます！そして、これからも！": "Terima kasih! Dan mari kita lanjutkan perjalanan ini bersama-sama!",
  "改装設計図 を獲得しました！": "Cetak biru diperoleh!",
  "「補強増設」も良かったら……食べてみます？": "Apakah Anda ingin mencoba Ekspansi Penguatan juga?",
  "補強増設 を獲得しました！": "Ekspansi Penguatan diperoleh!",
  "「艦これ」は今春11周年！提督、お祝いと感謝です！": "\"KanColle\" sekarang berusia 11 tahun! Laksamana, selamat dan terima kasih!",
  "改修資材 x 11 を獲得しました！": "Sekrup x11 diperoleh!",
  "まさかオブまさかの11周年！  提督と共に12年目の海へ！": "Luar biasa, ini adalah hari jadinya yang ke 11! Ini untuk satu tahun lagi\ndi laut bersamamu, Laksamana, sekarang memasuki tahun ke-12 kita!",
  "装備運用枠【＋11装備分】 を獲得しました！": "Penyimpanan Peralatan [11 slot] diperoleh!",
  "提督、本当にありがとう！そして、これからも艦娘と！": "Laksamana, terima kasih banyak! Dan mari kita lanjutkan dengan para gadis kapal mulai sekarang!",
  "戦闘詳報 を獲得しました！": "Laporan Pertempuran diperoleh!",
  "除籍艦": "Kapal yang Dinonaktifkan",
  "dummy": "forNoComma"
}